//Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string inputString = "aBcD1ef!-";

Console.WriteLine(inputString.ToLower()); 
